#产生1个0~99的列表
a=list(range(0,100))
#你能写出几种让列表元素逆序排列的方法（结果仍存放在a中）？答案写在下面。
a.reverse()#第一种
a=[i for i in range(99,-1,-1)]#第二种
a=list(range(99,-1,-1))#第三种
a=[a[99-i] for i in a]#第四种
a=[99-i for i in a]#第五种
#[99, 98, 97, 96, 95, 94, 93, 92, 91, 90, 89, 88, 87, 86, 85, 84, 83, 82, 81, 80, 79, 78, 77, 76, 75, 74, 73, 72, 71, 70, 69, 68, 67, 66, 65, 64, 63, 62, 61, 60, 59, 58, 57, 56, 55, 54, 53, 52, 51, 50, 49, 48, 47, 46, 45, 44, 43, 42, 41, 40, 39, 38, 37, 36, 35, 34, 33, 32, 31, 30, 29, 28, 27, 26, 25, 24, 23, 22, 21, 20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0]

#重新排序
a.sort()

#利用列表推导式，得到a中所有的质数,存放在列表b中。答案写在下面。
import sympy
b=[i for i in a if sympy.isprime(i)==True]
#[2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]

#利用列表推导式，得到a中所有能被2或3整除的数,存放在列表d中。答案写在下面。
d=[i for i in a if i%2==0 or i%3==0]
#[0, 2, 3, 4, 6, 8, 9, 10, 12, 14, 15, 16, 18, 20, 21, 22, 24, 26, 27, 28, 30, 32, 33, 34, 36, 38, 39, 40, 42, 44, 45, 46, 48, 50, 51, 52, 54, 56, 57, 58, 60, 62, 63, 64, 66, 68, 69, 70, 72, 74, 75, 76, 78, 80, 81, 82, 84, 86, 87, 88, 90, 92, 93, 94, 96, 98, 99]

#水仙花数是一个n(n大于等于3）位数字的数，它等于每个数字的n次幂之和。
#例如,153是一个水仙花数，因为153=1**3+5**3+3**3。
#求所有3位数中的水仙花数。
#方法1：用列表推导式，将下一行补充完整。
narcissus_list =[a*100+b*10+c for a in range(1,10) for b in range(10) for c in range(10) if a**3+b**3+c**3==a*100+b*10+c]
print(narcissus_list) 
#[153, 370, 371, 407]

#方法2：用生成器推导式，将下一行补充完整。
narcissus_gen = (a*100+b*10+c for a in range(1,10) for b in range(10) for c in range(10) if a**3+b**3+c**3==a*100+b*10+c)
narcissus = [next(narcissus_gen) for x in range(4) ] 
print(narcissus) 
